aydarik/geekmagic-tv-esp8266/src/webserver.cpp
#include "webserver.h"
#include "config.h"
#include "display.h"
#include "settings.h"
#include "themes/notification.h"
#include "themes/countdown.h"
#include "themes/clock.h"
#include "main.h"
#include "logger.h"
#include "utils.h"
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <ESPAsyncWebServer.h>
#include <ESP8266WiFi.h>

#include "generated/index_html.h"
#include "generated/ota_html.h"

static AsyncWebServer server(WEB_SERVER_PORT);
static AsyncWebSocket ws("/ws");

extern Settings  appSettings;
extern NotificationState notificationState;
extern CountdownState    countdownState;
extern ClockState        clockState;

// ---------------------------------------------------------------------------
// WebSocket — broadcast JSON events to all connected clients
// ---------------------------------------------------------------------------

void wsBroadcast(const JsonDocument &doc) {
    if (ws.count() == 0) return;
    String payload;
    serializeJson(doc, payload);
    ws.textAll(payload);
}

void wsBroadcastState() {
    if (ws.count() == 0) return;
    JsonDocument doc;
    if (displayState.theme != Theme::NONE)
        doc["theme"] = static_cast<int8_t>(displayState.theme);

    doc["brt"] = appSettings.brightness;

    doc["mem_heap"] = ESP.getFreeHeap();

    FSInfo fs_info;
    LittleFS.info(fs_info);
    doc["space_free"] = fs_info.totalBytes - fs_info.usedBytes;

    wsBroadcast(doc);
}

void webserverHandle() {
    ws.cleanupClients();
}

// ---------------------------------------------------------------------------
// JSON response helpers
// ---------------------------------------------------------------------------

static void sendJson(AsyncWebServerRequest *request, const JsonDocument &doc) {
    AsyncResponseStream *response = request->beginResponseStream("application/json");
    serializeJson(doc, *response);
    request->send(response);
}

// ---------------------------------------------------------------------------
// GET /app.json
// ---------------------------------------------------------------------------

static void handleAppJson(AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["ip"]          = WiFi.localIP().toString();
    doc["brt"]         = appSettings.brightness;
    doc["theme"]       = static_cast<int8_t>(displayState.theme);
    doc["defaultTheme"]= static_cast<int8_t>(appSettings.defaultTheme);
    doc["img"]         = displayState.image;
    doc["tz"]          = appSettings.tz;
    doc["showIP"]      = appSettings.showIP;
    doc["showSec"]     = appSettings.showSec;
    doc["showWeather"] = appSettings.showWeather;
    doc["owmLoc"]      = appSettings.owmLocation;
    // Note: owmKey intentionally omitted from this endpoint
    if (displayState.timeout != 0)
        doc["timeout"] = displayState.timeout;
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /space.json
// ---------------------------------------------------------------------------

static void handleSpaceJson(AsyncWebServerRequest *request) {
    FSInfo fs_info;
    LittleFS.info(fs_info);
    JsonDocument doc;
    doc["total"] = fs_info.totalBytes;
    doc["free"]  = fs_info.totalBytes - fs_info.usedBytes;
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /memory.json
// ---------------------------------------------------------------------------

static void handleMemoryJson(AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["heap"]  = ESP.getFreeHeap();
    doc["fragm"] = ESP.getHeapFragmentation();
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /brt.json
// ---------------------------------------------------------------------------

static void handleBrtJson(AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["brt"] = appSettings.brightness;
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /v.json
// ---------------------------------------------------------------------------

static void handleVersionJson(AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["m"] = FIRMWARE_MODEL;
    doc["v"] = FIRMWARE_VERSION_STRING;
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /message.json
// ---------------------------------------------------------------------------

static void handleMessageJson(AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["msg"]   = notificationState.message;
    doc["sbj"]   = notificationState.subject;
    doc["style"] = notificationState.style;
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /note.json
// ---------------------------------------------------------------------------

static void handleNoteJson(AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["note"] = clockState.note;
    if (clockState.noteRotations > 0)
        doc["rpm"] = clockState.noteRotations;
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /set — device control endpoint
// All args are URL-decoded by ESPAsyncWebServer automatically.
// ---------------------------------------------------------------------------

static void handleSet(AsyncWebServerRequest *request) {
    if (request->hasParam("msg")) {
        const AsyncWebParameter *pMsg = request->getParam("msg");
        strncpy(notificationState.message, pMsg->value().c_str(), NOTIFICATION_MSG_BUFFER_SIZE - 1);
        notificationState.message[NOTIFICATION_MSG_BUFFER_SIZE - 1] = '\0';

        const AsyncWebParameter *pSbj = request->getParam("sbj");
        if (pSbj) {
            strncpy(notificationState.subject, pSbj->value().c_str(), NOTIFICATION_SBJ_BUFFER_SIZE - 1);
            notificationState.subject[NOTIFICATION_SBJ_BUFFER_SIZE - 1] = '\0';
        } else {
            notificationState.subject[0] = '\0';
        }

        const AsyncWebParameter *pStyle = request->getParam("style");
        if (pStyle) {
            strncpy(notificationState.style, pStyle->value().c_str(), NOTIFICATION_STYLE_BUFFER_SIZE - 1);
            notificationState.style[NOTIFICATION_STYLE_BUFFER_SIZE - 1] = '\0';
        } else {
            notificationState.style[0] = '\0';
        }

