aydarik/geekmagic-tv-esp8266/src/webserver.cpp
        time_t timeoutAt = 0;
        const AsyncWebParameter *pTimeout = request->getParam("timeout");
        if (pTimeout) {
            const int timeout = pTimeout->value().toInt();
            if (timeout > 0) timeoutAt = time(nullptr) + timeout;
        }
        displayScheduleUpdate(Theme::NOTIFICATION, true, timeoutAt);

    } else if (request->hasParam("note")) {
        const bool hadNote = clockState.note[0] != '\0';
        const AsyncWebParameter *pNote = request->getParam("note");
        strncpy(clockState.note, pNote->value().c_str(), CLOCK_NOTE_SIZE - 1);
        clockState.note[CLOCK_NOTE_SIZE - 1] = '\0';
        const bool hasNote = clockState.note[0] != '\0';

        const AsyncWebParameter *pRpm = request->getParam("rpm");
        clockState.noteRotations = pRpm ? pRpm->value().toInt() : 0;
        if (clockState.noteRotations > 60) clockState.noteRotations = 60;

        const AsyncWebParameter *pTimeout = request->getParam("timeout");
        if (pTimeout) {
            const int timeout = pTimeout->value().toInt();
            clockState.noteTimeout = timeout > 0 ? time(nullptr) + timeout : 0;
        } else {
            clockState.noteTimeout = 0;
        }

        const AsyncWebParameter *pForce = request->getParam("force");
        const String force = pForce ? pForce->value() : "";
        if (displayState.theme == Theme::CLOCK
            && (hadNote != hasNote
                || force.equalsIgnoreCase("true")
                || force == "1")) {
            displayScheduleUpdate(Theme::NONE, true);
        }

    } else if (request->hasParam("cnt")) {
        const AsyncWebParameter *pSbj = request->getParam("sbj");
        if (pSbj) {
            strncpy(countdownState.subject, pSbj->value().c_str(), COUNTDOWN_SBJ_BUFFER_SIZE - 1);
            countdownState.subject[COUNTDOWN_SBJ_BUFFER_SIZE - 1] = '\0';
        } else {
            countdownState.subject[0] = '\0';
        }

        const AsyncWebParameter *pCnt = request->getParam("cnt");
        strncpy(countdownState.datetime, pCnt->value().c_str(), COUNTDOWN_DATETIME_BUFFER_SIZE - 1);
        countdownState.datetime[COUNTDOWN_DATETIME_BUFFER_SIZE - 1] = '\0';

        time_t timeoutAt = 0;
        const AsyncWebParameter *pTimeout = request->getParam("timeout");
        if (pTimeout) {
            const int timeout = pTimeout->value().toInt();
            if (timeout > 0) {
                const time_t dt = parseDateTime(countdownState.datetime);
                if (dt > time(nullptr)) timeoutAt = dt + timeout;
            }
        }
        displayScheduleUpdate(Theme::COUNTDOWN, true, timeoutAt);

    } else if (request->hasParam("brt")) {
        appSettings.brightness = request->getParam("brt")->value().toInt();
        displaySetBrightness(appSettings.brightness);
        settingsSave(appSettings);

    } else if (request->hasParam("theme")) {
        const auto theme = static_cast<Theme>(request->getParam("theme")->value().toInt());
        const bool setDefault = request->hasParam("default") && request->getParam("default")->value() != "false";
        if (setDefault) {
            appSettings.defaultTheme = theme;
            settingsSave(appSettings);
        }
        displayScheduleUpdate(theme, true);

    } else if (request->hasParam("img")) {
        const AsyncWebParameter *pImg = request->getParam("img");
        strncpy(displayState.image, pImg->value().c_str(), DISPLAY_IMG_PATH_BUFFER_SIZE - 1);
        displayState.image[DISPLAY_IMG_PATH_BUFFER_SIZE - 1] = '\0';

        time_t timeoutAt = 0;
        const AsyncWebParameter *pTimeout = request->getParam("timeout");
        if (pTimeout) {
            const int timeout = pTimeout->value().toInt();
            if (timeout > 0) timeoutAt = time(nullptr) + timeout;
        }
        displayScheduleUpdate(Theme::IMAGE, true, timeoutAt);

    } else if (request->hasParam("ip")) {
        appSettings.showIP = request->getParam("ip")->value() != "false";
        if (displayState.theme == Theme::CLOCK) displayScheduleUpdate(Theme::NONE, true);
        settingsSave(appSettings);

    } else if (request->hasParam("sec")) {
        appSettings.showSec = request->getParam("sec")->value() != "false";
        if (displayState.theme == Theme::CLOCK || displayState.theme == Theme::BIG_CLOCK) displayScheduleUpdate(Theme::NONE, true);
        settingsSave(appSettings);

    } else if (request->hasParam("weather")) {
        appSettings.showWeather = request->getParam("weather")->value() != "false";
        if (displayState.theme == Theme::CLOCK) displayScheduleUpdate(Theme::NONE, true);
        settingsSave(appSettings);

    } else if (request->hasParam("tz")) {
        const AsyncWebParameter *pTz = request->getParam("tz");
        strncpy(appSettings.tz, pTz->value().c_str(), sizeof(appSettings.tz) - 1);
        appSettings.tz[sizeof(appSettings.tz) - 1] = '\0';
        setenv("TZ", appSettings.tz, 1);
        tzset();
        if (displayState.theme == Theme::CLOCK) displayScheduleUpdate(Theme::NONE, true);
        settingsSave(appSettings);

    } else if (request->hasParam("owmLoc") && request->hasParam("owmKey")) {
        const AsyncWebParameter *pLoc = request->getParam("owmLoc");
        const AsyncWebParameter *pKey = request->getParam("owmKey");
        strncpy(appSettings.owmLocation, pLoc->value().c_str(), sizeof(appSettings.owmLocation) - 1);
        appSettings.owmLocation[sizeof(appSettings.owmLocation) - 1] = '\0';
        strncpy(appSettings.owmApiKey,   pKey->value().c_str(), sizeof(appSettings.owmApiKey) - 1);
        appSettings.owmApiKey[sizeof(appSettings.owmApiKey) - 1] = '\0';
        if (displayState.theme == Theme::CLOCK) displayScheduleUpdate(Theme::NONE, true);
        settingsSave(appSettings);

    } else {
        request->send(400, "text/plain", "No action");
        return;
    }

    request->send(200, "text/plain", "OK");
}

// ---------------------------------------------------------------------------
// GET /test
// ---------------------------------------------------------------------------

static void handleTest(AsyncWebServerRequest *request) {
    displayScheduleTest();
    request->send(200, "text/plain", "OK");
}

// ---------------------------------------------------------------------------
// GET /delete
// ---------------------------------------------------------------------------

static void handleDelete(AsyncWebServerRequest *request) {
    if (!request->hasParam("file")) {
        request->send(400, "text/plain", "Missing file parameter");
        return;
    }
    const String path = request->getParam("file")->value();
    if (LittleFS.remove(path)) {
        logPrintf("File deleted: %s", path.c_str());
        request->send(200, "text/plain", "Deleted");
    } else {
        request->send(404, "text/plain", "Not found");
    }
}

// ---------------------------------------------------------------------------
// GET /filelist — HTML table (compatible with legacy API)
// ---------------------------------------------------------------------------

