aydarik/geekmagic-tv-esp8266/src/webserver.cpp
static void streamDirRecursive(AsyncResponseStream *stream, const char *dirname) {
    File root = LittleFS.open(dirname, "r");
    if (!root || !root.isDirectory()) return;

    File file = root.openNextFile();
    while (file) {
        if (file.isDirectory()) {
            const size_t len = strlen(file.fullName()) + 2;
            char childPath[len];
            snprintf(childPath, len, "/%s", file.fullName());
            streamDirRecursive(stream, childPath);
        } else {
            const char *fileName = file.name();
            const size_t fileSize = file.size();
            auto fnameLower = String(fileName);
            fnameLower.toLowerCase();

            stream->print("<tr><td>");
            if (strcmp(displayState.image, file.fullName()) == 0)
                stream->print("&#x2714; ");
            stream->printf("<a href='%s/%s'>%s</a></td>", dirname, fileName, fileName);
            stream->printf("<td class='size'>%u</td>", fileSize);
            stream->print("<td><div class='button-group'>");
            stream->printf("<button class='button' onclick=\"deleteImage('%s/%s')\">DEL</button>", dirname, fileName);
            if (fnameLower.endsWith(".jpg"))
                stream->printf("<button class='button' onclick=\"displayImage('%s/%s')\">SET</button>", dirname, fileName);
            stream->print("</div></td></tr>\n");
        }
        file = root.openNextFile();
    }
}

static void handleFileList(AsyncWebServerRequest *request) {
    const char *dir = request->hasParam("dir") ? request->getParam("dir")->value().c_str() : "/";
    AsyncResponseStream *stream = request->beginResponseStream("text/html");
    stream->print("<table><thead><tr><th>Path</th><th>Size</th><th>Actions</th></tr></thead><tbody>\n");
    streamDirRecursive(stream, dir);
    stream->print("</tbody></table>\n");
    request->send(stream);
}

// ---------------------------------------------------------------------------
// GET /log
// ---------------------------------------------------------------------------

static void handleLog(AsyncWebServerRequest *request) {
    AsyncResponseStream *response = request->beginResponseStream("text/plain");
    logPrintTo(*response);
    request->send(response);
}

// ---------------------------------------------------------------------------
// GET /factoryreset
// ---------------------------------------------------------------------------

static void handleFactoryReset(AsyncWebServerRequest *request) {
    request->send(200, "text/plain", "Factory Reset triggered. Clearing data and restarting...");
    factoryReset();
}

// ---------------------------------------------------------------------------
// GET /scan        — start async WiFi scan, returns immediately
// GET /scan/results — poll for results; returns {"status":"scanning"} while
//                    in progress, or JSON array of networks when done.
// ---------------------------------------------------------------------------

static void handleWiFiScan(AsyncWebServerRequest *request) {
    // WIFI_SCAN_RUNNING = -1 means a scan is already in progress
    if (WiFi.scanComplete() == WIFI_SCAN_RUNNING) {
        request->send(200, "text/plain", "scan already running");
        return;
    }
    // async=true — returns immediately, no WDT risk
    WiFi.scanNetworks(true);
    request->send(200, "text/plain", "scan started");
}

static void handleWiFiScanResults(AsyncWebServerRequest *request) {
    const int n = WiFi.scanComplete();
    if (n == WIFI_SCAN_RUNNING) {
        // Still scanning — tell the client to poll again
        JsonDocument busy;
        busy["status"] = "scanning";
        sendJson(request, busy);
        return;
    }
    // n == WIFI_SCAN_FAILED or n >= 0
    JsonDocument doc;
    if (n > 0) {
        for (int i = 0; i < n; i++) {
            if (WiFi.SSID(i).isEmpty()) continue;
            JsonDocument entry;
            entry["ssid"] = WiFi.SSID(i);
            entry["rssi"] = WiFi.RSSI(i);
            doc.add(entry);
        }
    }
    WiFi.scanDelete();
    sendJson(request, doc);
}

// ---------------------------------------------------------------------------
// GET /connect — join a new WiFi network
// ---------------------------------------------------------------------------

static void handleWiFiConnect(AsyncWebServerRequest *request) {
    if (!request->hasParam("ssid")) {
        request->send(400, "text/plain", "Missing SSID");
        return;
    }
    const String ssid     = request->getParam("ssid")->value();
    const String password = request->hasParam("password") ? request->getParam("password")->value() : "";

    request->send(200, "text/plain", "Connecting...");

    WiFi.persistent(true);
    WiFi.setAutoReconnect(true);
    WiFi.softAPdisconnect(true);
    delay(100);
    WiFi.mode(WIFI_STA);
    delay(100);
    WiFi.begin(ssid.c_str(), password.c_str());

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 40) {
        attempts++;
        delay(500);
        yield();
    }

    if (WiFi.status() == WL_CONNECTED) showMessage(F("Success!\nRebooting..."));
    else showMessage(F("Failed :(\nRebooting..."));
    delay(2000);
    ESP.restart();
}

// ---------------------------------------------------------------------------
// POST /doUpload — file upload handler
// ---------------------------------------------------------------------------

static File uploadFile;

static void handleFileUpload(AsyncWebServerRequest *request, const String &filename,
                              size_t index, uint8_t *data, size_t len, bool final) {
    const String dir = request->hasParam("dir") ? request->getParam("dir")->value() : "/";
    if (!LittleFS.exists(dir)) LittleFS.mkdir(dir);

    if (index == 0) {
        const String filepath = dir + filename;
        uploadFile = LittleFS.open(filepath, "w");
        if (!uploadFile) logPrint("Failed to open file for writing!");
    }
    if (uploadFile && len > 0) {
        const size_t written = uploadFile.write(data, len);
        if (written != len) logPrintf("Only %u of %u bytes written!", written, len);
    }
    if (final && uploadFile) {
        uploadFile.close();
        logPrintf("File uploaded: %u bytes", index + len);
        request->send(200, "text/plain", "OK");
    }
}

// ---------------------------------------------------------------------------
// OTA update handlers
// ---------------------------------------------------------------------------

static void handleOTAUpload(AsyncWebServerRequest *request, const String &filename,
                              size_t index, uint8_t *data, size_t len, bool final) {
    if (index == 0) {
        showMessage(F("OTA Update..."));
        const uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
        if (!Update.begin(maxSketchSpace)) Update.printError(Serial);
    }
    if (len > 0 && Update.write(data, len) != len) {
        Update.printError(Serial);
    }
    if (final) {
        if (!Update.end(true)) {
            Update.printError(Serial);
            showMessage(F("OTA Failed!"));
        }
        const bool ok = !Update.hasError();
        request->send(200, "text/plain", ok ? F("OK - Rebooting...") : F("FAIL"));
        if (ok) {
            showMessage(F("Success!\nRebooting..."));
            delay(2000);
            ESP.restart();
        }
    }
}

// ---------------------------------------------------------------------------
// Serve static files from LittleFS (images etc.)
// ---------------------------------------------------------------------------

static void handleStatic(AsyncWebServerRequest *request) {
    const String path = request->url();
    if (!LittleFS.exists(path)) {
        request->send(404, "text/plain", "File not found");
        return;
    }
    const String contentType = path.endsWith(".jpg") ? "image/jpeg" : "application/octet-stream";
    request->send(LittleFS, path, contentType);
}

// ---------------------------------------------------------------------------
// WebSocket event handler
// ---------------------------------------------------------------------------

static void onWsEvent(AsyncWebSocket *srv, AsyncWebSocketClient *client,
                      AwsEventType type, void *arg, uint8_t *data, size_t len) {
    (void)srv; (void)arg; (void)data; (void)len;
    if (type == WS_EVT_CONNECT) {
        JsonDocument doc;
        doc["theme"] = static_cast<int8_t>(displayState.theme);
        doc["brt"]   = appSettings.brightness;
        char buf[128];
        const size_t len = serializeJson(doc, buf, sizeof(buf));
        client->text(buf, len);
    }
}

// ---------------------------------------------------------------------------
// webserverInit
// ---------------------------------------------------------------------------

void webserverInit() {
    ws.onEvent(onWsEvent);
    server.addHandler(&ws);

    // Root page (gzip compressed)
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
        AsyncWebServerResponse *resp = request->beginResponse(
            200, "text/html",
            src_generated_index_html_gz,
            src_generated_index_html_gz_len);
        resp->addHeader("Content-Encoding", "gzip");
        resp->addHeader("Cache-Control", "max-age=600");
        request->send(resp);
    });

    // OTA page (gzip compressed)
    server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request) {
        AsyncWebServerResponse *resp = request->beginResponse(
            200, "text/html",
            src_generated_ota_html_gz,
            src_generated_ota_html_gz_len);
        resp->addHeader("Content-Encoding", "gzip");
        resp->addHeader("Cache-Control", "max-age=600");
        request->send(resp);
    });

    // JSON endpoints
    server.on("/app.json",     HTTP_GET, handleAppJson);
    server.on("/space.json",   HTTP_GET, handleSpaceJson);
    server.on("/memory.json",  HTTP_GET, handleMemoryJson);
    server.on("/brt.json",     HTTP_GET, handleBrtJson);
    server.on("/v.json",       HTTP_GET, handleVersionJson);
    server.on("/message.json", HTTP_GET, handleMessageJson);
    server.on("/note.json",    HTTP_GET, handleNoteJson);

    // Control endpoints
    server.on("/set",          HTTP_GET, handleSet);
    server.on("/filelist",     HTTP_GET, handleFileList);
    server.on("/delete",       HTTP_GET, handleDelete);
    server.on("/test",         HTTP_GET, handleTest);
    server.on("/log",          HTTP_GET, handleLog);
    server.on("/factoryreset", HTTP_GET, handleFactoryReset);
    server.on("/scan",         HTTP_GET, handleWiFiScan);
    server.on("/scanresults",  HTTP_GET, handleWiFiScanResults);
    server.on("/connect",      HTTP_GET, handleWiFiConnect);

    // File upload
    server.on("/doUpload", HTTP_POST,
        [](AsyncWebServerRequest *request) { /* handled in upload callback */ },
        handleFileUpload);

    // OTA upload
    server.on("/update", HTTP_POST,
        [](AsyncWebServerRequest *request) { /* handled in upload callback */ },
        handleOTAUpload);

    // Fallback: serve files from LittleFS
    server.onNotFound(handleStatic);

    server.begin();
    Serial.println(F("Async web server started"));
}
